Repository: collective/pas.plugins.oidc
Catalog: src/pas/plugins/oidc/locales/*/LC_MESSAGES/pas.plugins.oidc.po
Languages: es

source: Add
es: Añadir

source: Allowed Groups
es: Grupos permitidos

source: Client ID
es: ID de cliente

source: Client secret
es: Secreto del cliente

source: Create authentication __ac ticket
es: Crear ticket __ac de autenticación

source: Create authentication auth_token (volto/restapi) ticket
es: Crear ticket de auth_token de autenticación (volto/restapi)

source: Create authentication ticket
es: Crear ticket de autenticación

source: Create groups / update group memberships
es: Crear grupos/actualizar las membresías de grupos

source: Create restapi ticket
es: Crear ticket restapi

source: Create user / update user properties
es: Crear usuario/actualizar las propiedades de usuario

source: Group
es: Grupo

source: Identity Domain Name
es: Identidad Nombre de Dominio

source: Installs the pas.plugins.oidc add-on.
es: Instala el complemento pas.plugins.oidc.

source: List of groups that are allowed to log in.
es: Lista de grupos que pueden iniciar sesión.

source: OIDC Plugin Settings
es: Configuración del complemento OIDC

source: OIDC Plugin manage the details of the OpenID Connect Authentication plugin Pluggable Auth Service functionality.
es: El plugin OIDC gestiona los detalles de la funcionalidad del plugin de autenticación OpenID Connect Pluggable Auth Service.

source: OIDC Settings
es: Configuración de OIDC

source: OIDC settings
es: Configuración de OIDC

source: OIDC/OAuth2 Issuer
es: Emisor de OIDC/OAuth2

source: Open ID scopes
es: Ámbitos de Open ID

source: Open ID scopes to request to the server
es: Ámbitos de ID abiertos para solicitar al servidor

source: Property used as userid
es: Propiedad utilizada como ID de usuario

source: Provider is not properly configured.
es: El proveedor no está configurado correctamente.

source: Redirect uris
es: URI de redireccionamiento

source: Required for Oracle Authentication Manager only
es: Solo es necesario para el Oracle Authentication Manager

source: Scope
es: Ámbito

source: There was an error during the login process. Please try again.
es: Hubo un error durante el proceso de inicio de sesión. Inténtalo de nuevo.

source: There was an error getting the oauth2 client.
es: Hubo un error al obtener el cliente oauth2.

source: Title
es: Título

source: Uninstalls the pas.plugins.oidc add-on.
es: Desinstala el complemento pas.plugins.oidc.

source: Use PKCE
es: Uso de PKCE

source: Use Zope session data manager
es: Usar el administrador de datos de sesión de Zope

source: Use a modified OpenID Schema for email_verified and phone_number_verified boolean values coming as string
es: Use un esquema OpenID modificado para email_verified y phone_number_verified con los valores booleanos que vienen como cadena

source: Use deprecated redirect_uri
es: Usar redirect_uri en desuso

source: Use deprecated redirect_uri for logout url(/Plone/acl_users/oidc/logout)
es: Usar redirect_uri en desuso para la URL de cierre de sesión (/Plone/acl_users/oidc/logout)

source: Use modified OpenID Schema
es: Usar el esquema de OpenID modificado

source: User info property used as groupid, default 'groups'
es: Propiedad de información de usuario utilizada como groupid, 'groups' por defecto

source: User info property used as userid, default 'sub'.
es: Propiedad de información de usuario utilizada como userid, 'sub' por defecto.

source: pas.plugins.oidc (uninstall)
es: pas.plugins.oidc (desinstalar)
